In [3]:
import pandas as pd

### DataTypes - Series - 1 Dimensional

In [4]:
car_brand_series = pd.Series(["BMW","Toyoto","Honda"])

In [5]:
car_brand_series

0       BMW
1    Toyoto
2     Honda
dtype: object

In [6]:
colour_type_series = pd.Series(["Red","Yellow","Black"])

In [7]:
colour_type_series

0       Red
1    Yellow
2     Black
dtype: object

### DataTypes - DataFrame - 2 Dimensional

In [8]:
car_data = pd.DataFrame({"Brand":car_brand_series,"Colour":colour_type_series})

In [9]:
car_data

    Brand  Colour
0     BMW     Red
1  Toyoto  Yellow
2   Honda   Black

### Import Data
- csv
    - row - (axis-0)
    - column - (axis-1)

In [10]:
car_sales = pd.read_csv('data/car-sales.csv')
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

### Export Data

In [11]:
# Function
car_sales.to_csv('data/car-sales-op.csv', index=False)

### Describe Data

In [12]:
# Attribute - Column Data Types
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [13]:
# Attribute - List Of Columns
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [14]:
# Attribute - Detail About Index Column
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [15]:
# Function - Math Fn On Numeric Columns
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [16]:
# Function - index + dtypes
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [17]:
# Function - No Of Rows
len(car_sales)

10

In [18]:
# Function - mean/average values of Numeric Columns in a pandas DataFrame
car_sales.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [19]:
# Mean On Series
age = pd.Series([10,20,30,40,50])
age.mean()

30.0

### Viewing/Selecting Data

In [20]:
# Selecting specific columns
car_sales["Make"] # Or car_sales.Make but this one doesn't work where column name has space

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [21]:
car_sales[car_sales['Odometer (KM)'] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [22]:
# Top 5 Rows
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [23]:
car_sales.head(10)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [24]:
# Botton Rows
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [25]:
# .loc & .iloc
animals = pd.Series(["Cat","Dog","Mouse","Monkey","Pig","Sparrow"],index=[0,8,2,3,2,5])

In [26]:
animals

0        Cat
8        Dog
2      Mouse
3     Monkey
2        Pig
5    Sparrow
dtype: object

In [27]:
# Fetch Data Based on Index Value
animals.loc[2]

2    Mouse
2      Pig
dtype: object

In [28]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [29]:
# Fetch Row Number or Index Location, count rows starting with 0
animals.iloc[4]

'Pig'

In [30]:
# Slicing with loc/iloc
animals.iloc[:4]

0       Cat
8       Dog
2     Mouse
3    Monkey
dtype: object

In [31]:
# Regex
car_sales["Price"] = car_sales["Price"].str.replace(r'\$', '', regex=True)\
                                       .str.replace(r',', '', regex=True)\
                                       .str.replace(r'\.00$', '', regex=True)\
                                       .astype(int)
car_sales

     Make Colour  Odometer (KM)  Doors  Price
0  Toyota  White         150043      4   4000
1   Honda    Red          87899      4   5000
2  Toyota   Blue          32549      3   7000
3     BMW  Black          11179      5  22000
4  Nissan  White         213095      4   3500
5  Toyota  Green          99213      4   4500
6   Honda   Blue          45698      4   7500
7   Honda   Blue          54738      4   7000
8  Toyota  White          60000      4   6250
9  Nissan  White          31600      4   9700

In [32]:
# compare 2 columns
pd.crosstab(car_sales['Make'], car_sales['Doors'])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [33]:
# group by single column
car_sales.groupby(['Make'])[['Odometer (KM)', 'Doors']].mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [34]:
# group by multiple column
car_sales.groupby(['Make','Colour'])[['Odometer (KM)', 'Doors']].mean()

               Odometer (KM)  Doors
Make   Colour
BMW    Black         11179.0    5.0
Honda  Blue          50218.0    4.0
       Red           87899.0    4.0
Nissan White        122347.5    4.0
Toyota Blue          32549.0    3.0
       Green         99213.0    4.0
       White        105021.5    4.0

In [35]:
%matplotlib inline
import matplotlib.pyplot as plt

In [36]:
car_sales['Odometer (KM)'].plot()

In [37]:
car_sales['Odometer (KM)'].hist()

In [38]:
car_sales['Price'].hist()

### Manipulating Data

In [39]:
car_sales['Make'] = car_sales['Make'].str.lower()
car_sales

     Make Colour  Odometer (KM)  Doors  Price
0  toyota  White         150043      4   4000
1   honda    Red          87899      4   5000
2  toyota   Blue          32549      3   7000
3     bmw  Black          11179      5  22000
4  nissan  White         213095      4   3500
5  toyota  Green          99213      4   4500
6   honda   Blue          45698      4   7500
7   honda   Blue          54738      4   7000
8  toyota  White          60000      4   6250
9  nissan  White          31600      4   9700

In [40]:
car_sales_missing_data = pd.read_csv('data/car-sales-missing-data.csv')
car_sales_missing_data

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [41]:
# car_sales_missing_data['Odometer'] = car_sales_missing_data['Odometer'].fillna(car_sales_missing_data['Odometer'].mean())
# either assign or use 'inplace'
car_sales_missing_data.fillna({'Odometer': car_sales_missing_data['Odometer'].mean()}, inplace=True)
car_sales_missing_data

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [42]:
# to update same df use car_sales_missing_data.dropna(inplace=True)
car_sales_without_missing_data = car_sales_missing_data.dropna()
car_sales_without_missing_data

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [43]:
# Define New Column
seats_column = pd.Series([5,8,5,9,5])
# Add New Column
car_sales['Seats'] = seats_column 
car_sales

     Make Colour  Odometer (KM)  Doors  Price  Seats
0  toyota  White         150043      4   4000    5.0
1   honda    Red          87899      4   5000    8.0
2  toyota   Blue          32549      3   7000    5.0
3     bmw  Black          11179      5  22000    9.0
4  nissan  White         213095      4   3500    5.0
5  toyota  Green          99213      4   4500    NaN
6   honda   Blue          45698      4   7500    NaN
7   honda   Blue          54738      4   7000    NaN
8  toyota  White          60000      4   6250    NaN
9  nissan  White          31600      4   9700    NaN

In [44]:
car_sales.fillna({'Seats':4},inplace=True)
car_sales

     Make Colour  Odometer (KM)  Doors  Price  Seats
0  toyota  White         150043      4   4000    5.0
1   honda    Red          87899      4   5000    8.0
2  toyota   Blue          32549      3   7000    5.0
3     bmw  Black          11179      5  22000    9.0
4  nissan  White         213095      4   3500    5.0
5  toyota  Green          99213      4   4500    4.0
6   honda   Blue          45698      4   7500    4.0
7   honda   Blue          54738      4   7000    4.0
8  toyota  White          60000      4   6250    4.0
9  nissan  White          31600      4   9700    4.0

In [45]:
import random
mielage_column = [random.randint(1, 100) for _ in range(10)]
car_sales['mielage'] = mielage_column 
car_sales

     Make Colour  Odometer (KM)  Doors  Price  Seats  mielage
0  toyota  White         150043      4   4000    5.0       45
1   honda    Red          87899      4   5000    8.0       81
2  toyota   Blue          32549      3   7000    5.0       11
3     bmw  Black          11179      5  22000    9.0       89
4  nissan  White         213095      4   3500    5.0       76
5  toyota  Green          99213      4   4500    4.0       43
6   honda   Blue          45698      4   7500    4.0       56
7   honda   Blue          54738      4   7000    4.0       95
8  toyota  White          60000      4   6250    4.0       86
9  nissan  White          31600      4   9700    4.0       77

In [46]:
car_sales['fuel_consumed_per_1k_Miles'] = car_sales['Odometer (KM)']/1000 * car_sales['mielage'] 
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,mielage,fuel_consumed_per_1k_Miles
0,toyota,White,150043,4,4000,5.0,45,6751.935
1,honda,Red,87899,4,5000,8.0,81,7119.819
2,toyota,Blue,32549,3,7000,5.0,11,358.039
3,bmw,Black,11179,5,22000,9.0,89,994.931
4,nissan,White,213095,4,3500,5.0,76,16195.220
5,toyota,Green,99213,4,4500,4.0,43,4266.159
6,honda,Blue,45698,4,7500,4.0,56,2559.088
7,honda,Blue,54738,4,7000,4.0,95,5200.110
8,toyota,White,60000,4,6250,4.0,86,5160.000
9,nissan,White,31600,4,9700,4.0,77,2433.200

In [47]:
car_sales['safety_chk'] = True
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,mielage,fuel_consumed_per_1k_Miles,safety_chk
0,toyota,White,150043,4,4000,5.0,45,6751.935,True
1,honda,Red,87899,4,5000,8.0,81,7119.819,True
2,toyota,Blue,32549,3,7000,5.0,11,358.039,True
3,bmw,Black,11179,5,22000,9.0,89,994.931,True
4,nissan,White,213095,4,3500,5.0,76,16195.220,True
5,toyota,Green,99213,4,4500,4.0,43,4266.159,True
6,honda,Blue,45698,4,7500,4.0,56,2559.088,True
7,honda,Blue,54738,4,7000,4.0,95,5200.110,True
8,toyota,White,60000,4,6250,4.0,86,5160.000,True
9,nissan,White,31600,4,9700,4.0,77,2433.200,True

In [48]:
car_sales.drop('safety_chk', axis=1, inplace= True)
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,mielage,fuel_consumed_per_1k_Miles
0,toyota,White,150043,4,4000,5.0,45,6751.935
1,honda,Red,87899,4,5000,8.0,81,7119.819
2,toyota,Blue,32549,3,7000,5.0,11,358.039
3,bmw,Black,11179,5,22000,9.0,89,994.931
4,nissan,White,213095,4,3500,5.0,76,16195.220
5,toyota,Green,99213,4,4500,4.0,43,4266.159
6,honda,Blue,45698,4,7500,4.0,56,2559.088
7,honda,Blue,54738,4,7000,4.0,95,5200.110
8,toyota,White,60000,4,6250,4.0,86,5160.000
9,nissan,White,31600,4,9700,4.0,77,2433.200

In [49]:
# 70% Sample of data from df with random index in place
car_sales.sample(frac=.7)

,Make,Colour,Odometer (KM),Doors,Price,Seats,mielage,fuel_consumed_per_1k_Miles
7,honda,Blue,54738,4,7000,4.0,95,5200.110
3,bmw,Black,11179,5,22000,9.0,89,994.931
4,nissan,White,213095,4,3500,5.0,76,16195.220
0,toyota,White,150043,4,4000,5.0,45,6751.935
2,toyota,Blue,32549,3,7000,5.0,11,358.039
5,toyota,Green,99213,4,4500,4.0,43,4266.159
9,nissan,White,31600,4,9700,4.0,77,2433.200

In [50]:
car_sales_shuffled = car_sales.sample(frac=1)
car_sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,mielage,fuel_consumed_per_1k_Miles
2,toyota,Blue,32549,3,7000,5.0,11,358.039
4,nissan,White,213095,4,3500,5.0,76,16195.220
7,honda,Blue,54738,4,7000,4.0,95,5200.110
9,nissan,White,31600,4,9700,4.0,77,2433.200
0,toyota,White,150043,4,4000,5.0,45,6751.935
1,honda,Red,87899,4,5000,8.0,81,7119.819
3,bmw,Black,11179,5,22000,9.0,89,994.931
5,toyota,Green,99213,4,4500,4.0,43,4266.159
8,toyota,White,60000,4,6250,4.0,86,5160.000
6,honda,Blue,45698,4,7500,4.0,56,2559.088

In [51]:
# shuffle rows without resetting index
car_sales_shuffled.reset_index(drop=True, inplace=True)
car_sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,mielage,fuel_consumed_per_1k_Miles
0,toyota,Blue,32549,3,7000,5.0,11,358.039
1,nissan,White,213095,4,3500,5.0,76,16195.220
2,honda,Blue,54738,4,7000,4.0,95,5200.110
3,nissan,White,31600,4,9700,4.0,77,2433.200
4,toyota,White,150043,4,4000,5.0,45,6751.935
5,honda,Red,87899,4,5000,8.0,81,7119.819
6,bmw,Black,11179,5,22000,9.0,89,994.931
7,toyota,Green,99213,4,4500,4.0,43,4266.159
8,toyota,White,60000,4,6250,4.0,86,5160.000
9,honda,Blue,45698,4,7500,4.0,56,2559.088

In [52]:
# use apply to invoke a py fn on column
car_sales_shuffled['Price'] = car_sales_shuffled['Price'].apply(lambda x : f'£{x}')
car_sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,mielage,fuel_consumed_per_1k_Miles
0,toyota,Blue,32549,3,£7000,5.0,11,358.039
1,nissan,White,213095,4,£3500,5.0,76,16195.220
2,honda,Blue,54738,4,£7000,4.0,95,5200.110
3,nissan,White,31600,4,£9700,4.0,77,2433.200
4,toyota,White,150043,4,£4000,5.0,45,6751.935
5,honda,Red,87899,4,£5000,8.0,81,7119.819
6,bmw,Black,11179,5,£22000,9.0,89,994.931
7,toyota,Green,99213,4,£4500,4.0,43,4266.159
8,toyota,White,60000,4,£6250,4.0,86,5160.000
9,honda,Blue,45698,4,£7500,4.0,56,2559.088